# Bar Terminations Data Get Document Method

Source: https://www.revitapidocs.com/2026/629ef4eb-406b-1526-8783-95f2c3309db8.htm

---

| Bar Terminations Data Get Document Method |
| --- |

Gets the document containing the hook type ids, end treatment ids and crank type ids.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Document GetDocument()
```

```
Public Function GetDocument As Document
```

```
public:
Document^ GetDocument()
```

```
member GetDocument : unit -> Document
```

#### Return Value

Document
Returns the document containing the hook type ids, end treatment ids and crank type ids. See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace